In [51]:
import pandas as pd

*pandas* has two main data structures it uses, namely, *Series* and *DataFrames*.
pandas Series

pandas Series one-dimensional labeled array.

# Series

In [8]:
ser = pd.Series(data= [1,2,3,4],index = ['one','two','three','four'])

In [9]:
ser.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [10]:
ser.values

array([1, 2, 3, 4], dtype=int64)

In [12]:
ser

one      1
two      2
three    3
four     4
dtype: int64

In [16]:
ser[0]

1

In [18]:
ser.loc[['one','two','three']]

one      1
two      2
three    3
dtype: int64

In [21]:
ser[['one']]

one    1
dtype: int64

In [19]:
ser.iloc[[0,1,2]]

one      1
two      2
three    3
dtype: int64

In [22]:
ser['two'] = 'two'
ser *2

one           2
two      twotwo
three         6
four          8
dtype: object

In [23]:
ser[['one','two']] * 2

one         2
two    twotwo
dtype: object

# Dataframe


pandas DataFrame

pandas DataFrame is a 2-dimensional labeled data structure.

Create DataFrame from dictionary of Python Series

### 1). Dictionary of Series

In [43]:
d = {'Chennai':pd.Series(data = [100,400,300],index =['chicken','mutton','quail']),'Salem':pd.Series(data = [120,440,330,250],index = ['chicken','mutton','quail','fish'])}
d

{'Chennai': chicken    100
 mutton     400
 quail      300
 dtype: int64, 'Salem': chicken    120
 mutton     440
 quail      330
 fish       250
 dtype: int64}

In [7]:
pd.DataFrame(d)

         Chennai  Salem
chicken    100.0    120
fish         NaN    250
mutton     400.0    440
quail      300.0    330

In [8]:
d1 = {'Chicken':pd.Series([200,400,359],index=['Chennai','Mumbai','Bangalore']),'Mutton':pd.Series([500,489,700],index=['Chennai','Mumbai','Bangalore'])}

In [9]:
d1

{'Chicken': Chennai      200
 Mumbai       400
 Bangalore    359
 dtype: int64, 'Mutton': Chennai      500
 Mumbai       489
 Bangalore    700
 dtype: int64}

In [24]:
df = pd.DataFrame(d1)
df

           Chicken  Mutton
Chennai        200     500
Mumbai         400     489
Bangalore      359     700

In [13]:
print(df)

           Chicken  Mutton
Chennai        200     500
Mumbai         400     489
Bangalore      359     700

In [45]:
df.index

Index(['chennai', 'mumbai', 'bangalore'], dtype='object')

In [46]:
df.columns

Index(['chicken', 'mutton'], dtype='object')

In [44]:
pd.DataFrame(d,['fish','mutton'])

        Chennai  Salem
fish        NaN    250
mutton    400.0    440

In [49]:
pd.DataFrame(d,index = ['fish','quail'],columns =['Salem','Chennai','rasipuram'])

       Salem  Chennai rasipuram
fish     250      NaN       NaN
quail    330    300.0       NaN

### 2).List of Dictionaries

In [50]:
data = [{'hari':10,'ravi':9},{'mark':7,'harry':7}]
data

[{'hari': 10, 'ravi': 9}, {'mark': 7, 'harry': 7}]

In [52]:
pd.DataFrame(data)

   hari  harry  mark  ravi
0  10.0    NaN   NaN   9.0
1   NaN    7.0   7.0   NaN

In [53]:
pd.DataFrame(data,index =['data analytics','data visualisation'])

                    hari  harry  mark  ravi
data analytics      10.0    NaN   NaN   9.0
data visualisation   NaN    7.0   7.0   NaN

In [54]:
pd.DataFrame(data,columns = ['hari','mark'])

   hari  mark
0  10.0   NaN
1   NaN   7.0

### 3).Dictionary of list

In [31]:
d = {'subject':['tamil','english','maths'],'marks':[67,89,99]}

In [32]:
pd.DataFrame(d)

   subject  marks
0    tamil     67
1  english     89
2    maths     99

In [41]:
pd.DataFrame(d).index

RangeIndex(start=0, stop=3, step=1)

### 4).List of List

In [50]:
d = [['tamil',67],['english',89],['maths',100]]
d

[['tamil', 67], ['english', 89], ['maths', 100]]

In [53]:
pd.DataFrame(d,columns=['Subject','Marks'])

   Subject  Marks
0    tamil     67
1  english     89
2    maths    100

### 5).Using Numpy Array

In [56]:
np.random.randn(5, 3)

array([[ 0.21255542,  1.13115442, -0.03433382],
       [ 0.97049736, -0.29007548, -1.69859309],
       [ 1.51770438, -0.74092365, -0.308622  ],
       [ 0.77782793,  0.29987386,  0.62733755],
       [-0.50265699,  0.32962838, -0.24237882]])

In [55]:
import numpy as np
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'], columns = ['one', 'two', 'three'])
df

        one       two     three
a  2.073501  0.110934  2.232669
c -0.455752  0.535989  1.035579
e  3.035315 -1.064374  0.730704
f  1.175924  1.203119 -0.533961
h  0.286055 -0.518208 -1.244940

In [58]:
df = pd.DataFrame(np.random.randint(2,1000,size=(5, 3)), index=['a', 'c', 'e', 'f','h'], columns = ['one', 'two', 'three'])
df

   one  two  three
a  859  480    980
c   43  871    778
e  518  935    677
f  694  278    247
h  358  844    264